#include <stdio.h>
#include <stdlib.h>
#define N1 5
#define N2 5
#define M2 3
int main()
{
    ///变量的值与指针的关系
    {
    double a = 1;
    double * ptr_a = &a;
        printf("变量的值与指针的关系----普通表达方式\n");
        printf("\n");
        printf("变量a的数据为: %-8.2lf\t 内存地址为: %p\n", a, &a);
        printf("\n");
        /// ////////////////////////////////////////////////////////
        printf("变量的值与指针的关系----指针表达方式\n");
        printf("\n");
        printf("变量a的数据为: %-8.2lf\t 内存地址为: %p\n", *ptr_a, ptr_a);
        printf("\n");
    }
    ///一维数组与指针的关系
    {
    int i;
    double a1[N1] = {1 , 2, 3, 4, 5};
    double * ptr_a1 = a1;// 等价于==> * ptr_a1 = &a1[0];
        //a1的值 与 &a1[0]的值一样 因此i+1个元素为=> &a1[i+1]=> a1 + i
        printf("一维数组与指针的关系----普通表达方式\n");
        printf("\n");
        for (i = 0; i < N1; i ++)
        {
            printf("变量a1[%d]既{%d}个元素数据为: %-8.2lf\t 内存地址为: %p\n", i, i + 1, a1[i], &a1[i]); //i+1个元素为=> &a1[i + 1]=> a1 + i
        }
        printf("\n");
        /// //////////////////////////////////////////////////////////////////////////////////////////////////
        printf("一维数组与指针的关系----指针表达方式一\n");
        printf("\n");
        for (i = 0; i < N1; i ++) //i在这里表示的是连续内存块的块数
        {                             //每一块的大小由数组定义的数据类型决定 sizeof(double) 为 8个字节;
            printf("变量a1[%d]既{%d}个元素数据为: %-8.2lf\t 内存地址为: %p\n", i, i + 1, * (a1 + i), a1 + i ); //a1 表示的是数组a1[0]的内存地址; 0号元素地址&a1[0]就是a1;
        }                                                                                                      //第i+1个元素的地址&a1[i+1]就是 a1 + i (8个字节);
        printf("\n");                                                                                          //带上"*" *a1 为该内存地址存放的数据 等效于 a[0]
        /// //////////////////////////////////////////////////////////////////////////////////////////////////
        printf("一维数组与指针的关系----指针表达方式二\n");
        printf("\n");
        for (i = 0; i < N1; i ++) //i在这里表示的是连续内存块的块数
        {                             //每一块的大小由数组定义的数据类型决定 sizeof(double) 为 8个字节;
            printf("变量a1[%d]既{%d}个元素数据为: %-8.2lf\t 内存地址为: %p\n", i, i + 1, * (ptr_a1 + i), ptr_a1 + i ); //ptr_a1 等价于的内存地址是 a1[0]元素的内存地址 &a1[0];
        }                                                                                                              //第i+1个元素的地址&a1[i+1]就是 a1 + i (8个字节);
        printf("\n");
        /// /////////////////////////////////////////////////////////////////////////////////////////////////
        printf("一维数组与指针的关系----指针表达方式三\n");
        printf("\n");
        for (i = 0; i < N1; i ++) //i在这里表示的是循环次数 上限为元素个数;
        {                             //每一块的大小由数组定义的数据类型决定 sizeof(double) 为 8个字节;
            printf("变量a1[%d]既{%d}个元素数据为: %-8.2lf\t 内存地址为: %p\n", i, i + 1, * ptr_a1, ptr_a1);
            * ptr_a1++;//*ptr_a1++ 代表 指针ptr_a1 内存地址 每次自增 以指针数据类型自增相应字节数
                       //缺点是指针位置停留在数组位置的末尾 从&a1[0] = * a1, 变为&a1[N]的位置
        }
        printf("\n");
        /// /////////////////////////////////////////////////////////////////////////////////////////////////
        printf("一维数组与指针的关系----指针表达方式三未初始化,不能完成对数组的打印\n");
        printf("\n");
            for (i = 0; i < N1; i ++) //i在这里表示的是循环次数 上限为元素个数;
        {                             //每一块的大小由数组定义的数据类型决定 sizeof(double) 为 8个字节;
            printf("变量a1[%d]既{%d}个元素数据为: %-8.2lf\t 内存地址为: %p\n", i, i + 1, * ptr_a1, ptr_a1);//由于之前 *ptr_a1 位置发生变化了 从&a1[0], a1 变为 &a1[N-1], a1 + (N -1)
            * ptr_a1++;

        }
        printf("\n");
        /// /////////////////////////////////////////////////////////////////////////////////////////////////
        printf("一维数组与指针的关系----指针表达方式三初始化后,能正常打印\n");
        printf("\n");
        ptr_a1 = a1;//指针内存地址初始化为数组首位置 &a1[0]
        for (i = 0; i < N1; i ++)
        {
            printf("变量a1[%d]既{%d}个元素数据为: %-8.2lf\t 内存地址为: %p\n", i, i + 1, * ptr_a1, ptr_a1);
            * ptr_a1++;
        }
        ptr_a1 = a1;//如指针位置不需要定位到数组后一块内存地址块 ,为了避免下次出错,结束数组使用后就将指针初始化
        printf("\n");
    }
    ///二维数组与指针的关系
    {
    double a2[N2][M2] = {
        {11, 12, 13},   // [0][0]
        {21, 22, 23},   // [1][0]
        {31, 32, 33},   // [2][0]
        {41, 42, 43},   // [3][0]
        {51, 52, 53},   // [4][0]
    };//定义一个二维数组
    int j, k;
    ///double * ptr_a2 = a2; 定义了一个指针 对应 一元数组a2[N2]; 每一块内存空间为 M2个 a2数据类型占据的字节数; 24 = 0x18;
                                 //只能操作a2[N2] 指针每次跳 M2 * sizeof(double)字节数8 = 3 * 8 = 24
                                 // [0][0]
                                 // [1][0]
                                 // [2][0]
                                 // [3][0]
                                 // [4][0]
    double (* ptr_a2)[M2] = a2;    // 如果使用 (*ptr_a2)[M2] = a2; 相当于指针地址为一个a[M2]的一元数组,ptr_a2[0] ... ptr_a2[M2]指针对应的内存地址数据,也存放在连续的内存块中.
    printf("二维数组与指针的关系----普通表达方式\n");
    printf("\n");
    for(k = 0; k < N2; k++)
    {
        for (j = 0; j < M2; j++)
        {
            printf("数组a2[%d][%d]既第a2第[%d]行第[%d]列的元素为: %-8.2lf    内存地址为: %p\t", k, j, k + 1, j + 1, a2[k][j], &a2[k][j]);
        }
        printf("\n");
    }
    printf("\n");

    for(k = 0; k < N2; k++)
    {
        for (j = 0; j < M2; j++)
        {
            printf("%-8.2lf  %p\t", a2[k][j], &a2[k][j]);
        }
        printf("\n");
    }
    printf("\n");
    /// ////////////////////////////////////////////////////////////////////////////////////////////////////
    printf("二维数组与指针的关系----指针表达方式一\n");
    printf("\n");
    for(k = 0; k < N2; k++)
    {
        for (j = 0; j < M2; j++)
        {
            printf("%-8.2lf  %p\t", *(*(a2 + k) + j), a2[k] + j );//a2[N2][M2] 首地址为 &a2[0][0] => a2[0] + 0, a2      a2[0][j]元素地址就是a2[0] + j
                                                                  //a2[1][0]  2行地址为 &a2[1][0] => a2[1] + 0, a2 + 1  a2[1][j]元素地址就是a2[1] + j
                                                                  //a2[k][0]  k行地址为 &a2[k][0] => a2[k] + 0, a2 + k  a2[k][j]元素地址就是a2[k] + j
        }
        printf("\n");
    }
    printf("\n");
     /// ////////////////////////////////////////////////////////////////////////////////////////////////////
    printf("二维数组与指针的关系----指针表达方式二\n");
    printf("\n");
    for(k = 0; k < N2; k++) //k表示为一段连续的内存,为M2列类型占用字节数总和 k每跳为3 * 8 = 24个字节
    {
        for (j = 0; j < M2; j++)//j表示为一块内存地址,为单个元素数据类型占用的字节 为 8个字节
        {
            printf("%-8.2lf  %p\t", *(*(ptr_a2 + k) + j), ptr_a2[k] + j ); //使用 (*ptr_a2)[M2] = a2; 相当于指针地址为一个a[M2]的一元数组,
                                                                ///未使用会报错: error: invalid type argument of unary '*' (have 'double')
                                                                //ptr_a2[N2][0] ... ptr_a2[N2][M2]指针对应的内存地址数据,也存放在连续的内存块中.
                                                                //*ptr_a2 + k 增加 段地址. 一段连续内存距离为k 为M2列类型占用字节数总和 k每跳为3 * 8 = 24个字节
                                                                //*(*ptr_a2 + k) + j) 增加 一段连续内存距离为k 再增加一块距离为j块地址, 为类型占用字节数 j每跳为8个字节
        }
        printf("\n");
    }
    printf("\n");
   /// //////////////////////////////////////////////////////////////////////////////////////////////////////
    printf("二维数组与指针的关系----指针表达方式三\n");
    printf("\n");

    double *ptr_a2n;//定义一个非一元数组形式的指针,并定位到 数组的初始内存位置即可
    ptr_a2n = a2;//a2[N2][M2]数组的初始位置
    for(k = 0; k < N2; k++) //i 只作为循环打印时控制行的次数和换行
    {
        for (j = 0; j < M2; j++)// j 只作为循环打印时控制列的元素个数;
        {
            printf("%-8.2lf  %p\t", * ptr_a2n, ptr_a2n);
            * ptr_a2n++; //每次增加一块内存地址块;位置从最初的 a2[0][0] 增加到最后的 a2[N2-1][M2-1] 共增加N2 * M2 - 1 个内存块地址;
                        //再次使用必须初始化; 重新将指针定位到数组的初始内存地址;
                        //否则指针指向的是 整个数组a2[N2][M2] 占用的连续内存空间后的一块内存空间,大小由a2[N2][M2]的数据类型决定
        }
        printf("\n");
    }
    printf("\n");
    }





    return 0;
}
